---
kind: type
id: T:Autodesk.Revit.DB.Mechanical.MEPHiddenLineSettings
source: html/36aa6fd1-8948-f89d-3206-8bba2c3db54c.htm
---
# Autodesk.Revit.DB.Mechanical.MEPHiddenLineSettings

Represents the settings contained in the document associated to the MEP hidden line display.

## Syntax (C#)
```csharp
public class MEPHiddenLineSettings : Element
```